AWorksOpen/aw_m1052/aworks_sdk/source/imxrt10xx_common/board/imxrt102x/cpu/include/imx1020_iomuxc_regs.h
    volatile uint32_t SAI1_MCLK_SELECT_INPUT;         /* offset 0x0430 */
    volatile uint32_t SAI1_RX_BCLK_SELECT_INPUT;      /* offset 0x0434 */
    volatile uint32_t SAI1_RX_DATA0_SELECT_INPUT;     /* offset 0x0438 */
    volatile uint32_t SAI1_RX_DATA1_SELECT_INPUT;     /* offset 0x043C */
    volatile uint32_t SAI1_RX_DATA2_SELECT_INPUT;     /* offset 0x0440 */
    volatile uint32_t SAI1_RX_DATA3_SELECT_INPUT;     /* offset 0x0444 */
    volatile uint32_t SAI1_RX_SYNC_SELECT_INPUT;      /* offset 0x0448 */
    volatile uint32_t SAI1_TX_BCLK_SELECT_INPUT;      /* offset 0x044C */
    volatile uint32_t SAI1_TX_SYNC_SELECT_INPUT;      /* offset 0x0450 */
    volatile uint32_t SAI2_MCLK_SELECT_INPUT;         /* offset 0x0454 */
    volatile uint32_t SAI2_RX_BCLK_SELECT_INPUT;      /* offset 0x0458 */
    volatile uint32_t SAI2_RX_DATA0_SELECT_INPUT;     /* offset 0x045C */
    volatile uint32_t SAI2_RX_SYNC_SELECT_INPUT;      /* offset 0x0460 */
    volatile uint32_t SAI2_TX_BCLK_SELECT_INPUT;      /* offset 0x0464 */
    volatile uint32_t SAI2_TX_SYNC_SELECT_INPUT;      /* offset 0x0468 */
    volatile uint32_t SAI3_MCLK_SELECT_INPUT;         /* offset 0x046C */
    volatile uint32_t SAI3_RX_BCLK_SELECT_INPUT;      /* offset 0x0470 */
    volatile uint32_t SAI3_RX_DATA0_SELECT_INPUT;     /* offset 0x0474 */
    volatile uint32_t SAI3_RX_SYNC_SELECT_INPUT;      /* offset 0x0478 */
    volatile uint32_t SAI3_TX_BCLK_SELECT_INPUT;      /* offset 0x047C */
    volatile uint32_t SAI3_TX_SYNC_SELECT_INPUT;      /* offset 0x0480 */

    volatile uint32_t SEMC_READY_SELECT_INPUT;        /* offset 0x0484 */
    volatile uint32_t SPDIF_IN_SELECT_INPUT;          /* offset 0x0488 */
    volatile uint32_t USB_OTG_OC_SELECT_INPUT;        /* offset 0x048C */
    volatile uint32_t USDHC1_CD_B_SELECT_INPUT;       /* offset 0x0490 */
    volatile uint32_t USDHC1_WP_SELECT_INPUT;         /* offset 0x0494 */
    volatile uint32_t USDHC2_CD_B_SELECT_INPUT;       /* offset 0x0498 */
    volatile uint32_t USDHC2_WP_SELECT_INPUT;         /* offset 0x049C */
    volatile uint32_t XBAR1_IN14_SELECT_INPUT;        /* offset 0x04A0 */
    volatile uint32_t XBAR1_IN15_SELECT_INPUT;        /* offset 0x04A4 */
    volatile uint32_t XBAR1_IN16_SELECT_INPUT;        /* offset 0x04A8 */
    volatile uint32_t XBAR1_IN17_SELECT_INPUT;        /* offset 0x04AC */
    volatile uint32_t XBAR1_IN10_SELECT_INPUT;        /* offset 0x04B0 */
    volatile uint32_t XBAR1_IN12_SELECT_INPUT;        /* offset 0x04B4 */
    volatile uint32_t XBAR1_IN13_SELECT_INPUT;        /* offset 0x04B8 */
    volatile uint32_t XBAR1_IN18_SELECT_INPUT;        /* offset 0x04BC */
    volatile uint32_t XBAR1_IN19_SELECT_INPUT;        /* offset 0x04C0 */

} hw_iomuxc_regs_t;

typedef struct {

    volatile uint32_t SNVS_SW_MUX_CTL_PAD_WAKEUP;          /* offset 0x00 */
    volatile uint32_t SNVS_SW_MUX_CTL_PAD_PMIC_ON_REQ;     /* offset 0x04 */
    volatile uint32_t SNVS_SW_MUX_CTL_PAD_PMIC_STBY_REQ;   /* offset 0x08 */
    volatile uint32_t SNVS_SW_PAD_CTL_PAD_TEST_MODE;       /* offset 0x0C */
    volatile uint32_t SNVS_SW_PAD_CTL_PAD_POR_B;           /* offset 0x10 */
    volatile uint32_t SNVS_SW_PAD_CTL_PAD_ONOFF;           /* offset 0x14 */
    volatile uint32_t SNVS_SW_PAD_CTL_PAD_WAKEUP;          /* offset 0x18 */
    volatile uint32_t SNVS_SW_PAD_CTL_PAD_PMIC_ON_REQ;     /* offset 0x1C */
    volatile uint32_t SNVS_SW_PAD_CTL_PAD_PMIC_STBY_REQ;   /* offset 0x20 */

} hw_iomuxc_snvs_regs_t;

#pragma pack(pop)



#ifdef __cplusplus
}
#endif  /* __cplusplus  */

#endif  /* __IMX1020_IOMUXC_REGS_H */

/* end of file */
